package pl.pingwit.homework2;

public class Task3 {
    public static void main(String[] args) {
        // Написать программу, которая выводит на экран сумму двух чисел

        byte myByte = 120;
        byte myByte2 = 50;

        int sum = myByte + myByte2;
        System.out.println(sum);
    }
}
