package pl.pingwit.homework2;

public class Task4 {
    public static void main(String[] args) {

        //Написать программу, которая выводит на экран произведение двух чисел

        int num1 = 5;
        int num2 = 6;
        System.out.println(num1 * num2);
    }
}
