package pl.pingwit.homework2;

public class Task6 {
    public static void main(String[] args) {

        // Написать программу, которая выводит на экран результат сложения двух строк

        int String1 = 190;
        int String2 = 210;
        System.out.println(String1 + String2);


    }
}
