package pl.pingwit.homework2;

public class Task5 {
    public static void main(String[] args) {

        //Написать программу, которая выводит на экран остаток от деления двух чисел

        int a = 10;
        int b = 5;

        System.out.println( a % b );
    }
}
